backend/app/models/team.rb

SELECT COUNT(*) FROM "teams" WHERE "teams"."group_id" = ?  [["group_id", 61]]
---
  def group_not_full
    return if group.nil?

    if group.teams.count >= Group::MAX_TEAMS