backend/app/services/knockout_advancer.rb

  def build_round_of_32
    raise NotReady, "Aún hay partidos de grupo pendientes" unless all_groups_completed?

    qualifiers = collect_qualifiers
    raise NotReady, "No hay 32 clasificados" unless qualifiers.size == 32

    ActiveRecord::Base.transaction do
      create_matches_for_phase("r32", qualifiers)
      @tournament.update!(status: "knockout")
---
UPDATE "tournaments" SET "status" = ?, "updated_at" = ? WHERE "tournaments"."id" = ?  [["status", "knockout"], ["updated_at", "2026-06-09 16:28:09.780610"], ["id", 2]]

  def advance!
    current = current_completed_phase
    return false if current.nil?

    next_phase = NEXT_PHASE[current]
    return false if next_phase.nil?

    # Idempotencia: si la siguiente ronda ya fue generada, no la recrea
    # (evita duplicar final/3er lugar al registrar el resultado de la final).
    return false if @tournament.matches.where(phase: next_phase).exists?
---
SELECT 1 AS one FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."phase" = ? LIMIT ?  [["tournament_id", 8], ["phase", "r16"], ["LIMIT", 1]]

  def all_groups_completed?
    @tournament.groups.all?(&:completed?)
---
SELECT "groups".* FROM "groups" WHERE "groups"."tournament_id" = ?  [["tournament_id", 8]]

  def create_matches_for_phase(phase, teams)
    teams.each_slice(2).with_index(1) do |(home, away), round_number|
      @tournament.matches.create!(
        phase: phase,
        round_number: round_number,
        home_team: home,
        away_team: away,
        status: "scheduled"
      )
---
INSERT INTO "matches" ("tournament_id", "group_id", "home_team_id", "away_team_id", "home_goals", "away_goals", "home_extra_goals", "away_extra_goals", "home_penalties", "away_penalties", "phase", "round_number", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def current_completed_phase
    %w[r32 r16 qf sf].reverse.find do |phase|
      matches = @tournament.matches.where(phase: phase)
      matches.any? && matches.pending.none?
---
SELECT 1 AS one FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."phase" = ? LIMIT ?  [["tournament_id", 8], ["phase", "sf"], ["LIMIT", 1]]

  def winners_of(phase)
    @tournament.matches
               .where(phase: phase)
               .order(:round_number)
               .map(&:winner)
---
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."phase" = ? ORDER BY "matches"."round_number" ASC  [["tournament_id", 8], ["phase", "r32"]]

  def build_final_and_third_place(sf_phase)
    sf_matches = @tournament.matches.where(phase: sf_phase).order(:round_number)
    winners = sf_matches.map(&:winner)
---
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."phase" = ? ORDER BY "matches"."round_number" ASC  [["tournament_id", 2], ["phase", "sf"]]
SELECT "matches".* FROM "matches" WHERE "matches"."tournament_id" = ? AND "matches"."phase" = ? ORDER BY "matches"."round_number" ASC  [["tournament_id", 8], ["phase", "sf"]]