backend/app/services/match_simulator.rb

UPDATE "tournaments" SET "status" = ?, "updated_at" = ? WHERE "tournaments"."id" = ?  [["status", "finished"], ["updated_at", "2026-06-09 17:09:53.406434"], ["id", 6]]
---
  def self.tournament(tournament)
    simulated = all_groups(tournament)

    advancer = KnockoutAdvancer.new(tournament)
    advancer.build_round_of_32 if tournament.group_stage?

    loop do
      pending = tournament.matches.knockout.pending
      break if pending.empty?

      simulated += simulate(pending)
      break if tournament.final_match&.played? # la final es la última ronda

      advancer.advance!
    end

    tournament.update!(status: "finished") if tournament.final_match&.played?