backend/app/services/match_result_recorder.rb

UPDATE "matches" SET "home_goals" = ?, "away_goals" = ?, "home_penalties" = ?, "away_penalties" = ?, "status" = ?, "updated_at" = ? WHERE "matches"."id" = ?  [["home_goals", 3], ["away_goals", 3], ["home_penalties", 5], ["away_penalties", 4], ["status", "played"], ["updated_at", "2026-06-09 16:28:09.782097"], ["id", 145]]
---
  def call
    ActiveRecord::Base.transaction do
      revert_team_stats if @match.played? && @match.group_phase?

      assign_score
      @match.status = "played"
      @match.save!

UPDATE "teams" SET "points" = ?, "goals_for" = ?, "goals_against" = ?, "goal_difference" = ?, "matches_played" = ?, "wins" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["points", 3], ["goals_for", 4], ["goals_against", 3], ["goal_difference", 1], ["matches_played", 1], ["wins", 1], ["updated_at", "2026-06-09 16:28:09.651496"], ["id", 50]]
---
  def update_team_stats
    home = @match.home_team
    away = @match.away_team

    apply_goals(home, scored: @match.home_goals, conceded: @match.away_goals)
    apply_goals(away, scored: @match.away_goals, conceded: @match.home_goals)

    if @match.home_goals > @match.away_goals
      register_win(home); register_loss(away)
    elsif @match.away_goals > @match.home_goals
      register_win(away); register_loss(home)
    else
      register_draw(home); register_draw(away)
    end

    home.save!