backend/app/serializers/group_serializer.rb

  def matches
    @group.matches.map { |m| MatchSerializer.new(m).as_json }
---
SELECT "matches".* FROM "matches" WHERE "matches"."group_id" = ?  [["group_id", 1]]