backend/app/controllers/api/v1/groups_controller.rb

      def index
        groups = Group.includes(:teams).order(:name)
        render_data(groups.map { |g| GroupSerializer.new(g).as_json })
---
SELECT "groups".* FROM "groups" ORDER BY "groups"."name" ASC
SELECT "teams".* FROM "teams" WHERE "teams"."group_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

      def set_group
        @group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]