backend/app/controllers/api/v1/matches_controller.rb

      def index
        matches = Match.all
        matches = matches.where(phase: params[:phase]) if params[:phase].present?
        matches = matches.where(status: params[:status]) if params[:status].present?
        matches = matches.order(:phase, :round_number, :id)
        render_data(matches.map { |m| MatchSerializer.new(m).as_json })
---
SELECT "matches".* FROM "matches" WHERE "matches"."phase" = ? AND "matches"."status" = ? ORDER BY "matches"."phase" ASC, "matches"."round_number" ASC, "matches"."id" ASC  [["phase", "group"], ["status", "scheduled"]]

      def result
        match = Match.find(params[:id])
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]