backend/app/controllers/api/v1/simulations_controller.rb

      def match
        render_matches([MatchSimulator.match(Match.find(params[:id]))])
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]