backend/app/controllers/api/v1/teams_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)  [["id", 101], ["id", 99], ["id", 107], ["id", 100], ["id", 102], ["id", 104], ["id", 97], ["id", 105], ["id", 103], ["id", 98], ["id", 108], ["id", 106]]
SELECT "teams".* FROM "teams" ORDER BY "teams"."name" ASC
---
      def index
        teams = Team.includes(:group).order(:name)
        render_data(teams.map { |t| TeamSerializer.new(t).as_json })