backend/app/controllers/api/v1/tournaments_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."tournament_id" = ?  [["tournament_id", 9]]
---
      def advance
        tournament = current_tournament
        advancer = KnockoutAdvancer.new(tournament)

        message =
          if tournament.group_stage?

SELECT "tournaments".* FROM "tournaments" ORDER BY "tournaments"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      def current_tournament
        Tournament.first || Tournament.create!(name: "Copa Mundial FIFA 2026", status: "setup")